/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "这项操作无法完成";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "发生未知错误（%d）"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "无法完成操作";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "请稍后再试。";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "无法录制";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "无法录制";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "停止其他所有使用“%@”的操作，再试一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "无法录制";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "磁盘空间不足，无法继续写文件。请删除现有视频或照片来腾出空间。";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "录制内容已达到许可的最长长度。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "录制内容已达到许可的最大文件大小。"; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "停止其他所有使用录制设备的操作，再试一次。";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "录制内容已达到许可的最长长度。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "无法录制";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "请重新录制。";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "无法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "停止其他所有使用“%@”的操作，再试一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "无法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "停止其他所有使用“%@”的操作，再试一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "已停止录制";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "停止其他所有使用录制设备的操作，再试一次。";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "未能打开闪光灯。";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "请尝试以较低的亮度打开闪光灯。";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "无法完成操作";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "请稍后再试。";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "无法完成导出";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "请重试导出。";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "无法解码";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "媒体数据无法被解码，可能已损坏。";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "不支持此媒体的格式。";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "无法存储";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "请重试存储。";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "无法写输出文件";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "更改输出文件的扩展名，然后再试一次。";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "无法使用此媒体。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "无法使用此媒体。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "无法使用此媒体。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "无法使用此媒体。";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "不支持此媒体的格式。";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "此媒体可能已损坏。";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "无法拍照";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "请重拍照片。";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "不支持对受保护的内容执行该操作。"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "此内容未得到授权。"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "此应用程序未得到授权，不能播放此文件。"; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "无法使用此媒体。";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "无法解码";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "找不到此媒体所需的解码器。";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "无法编码";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "找不到此媒体所需的编码器。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "无法解码";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "此媒体所需的解码器正忙。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "停止其他所有对媒体解密的操作，然后再试一次。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "无法编码";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "此媒体所需的编码器正忙。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "停止其他所有对媒体加密的操作，然后再试一次。";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "无法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "后台运行的应用程序可能无法使用“%@”。"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "不支持对此媒体执行该操作。";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "无法根据提供的指示来制作视频。";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "无法使用此媒体。";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "下载目的位置 URL 处的缓存文件不可使用。";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "此文件的校验和无效。";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "操作已中断";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "停止其他操作后再试一次。";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "打不开";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "该媒体无法在此设备上使用。";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "此媒体可能已损坏。";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "服务器配置不正确。";
